import 'package:flutter/widgets.dart';
import 'food.dart';

class Favorite extends ChangeNotifier {

   final  List<Food> _foodMenu = [
    Food(name: "🌻ผัดกะเพรา", imagePath: "lib/images/padkapow.jpg", 
        recipes: 
          "• หมูกรอบ 200 กรัม \n" 
          "• ถัวผักยาว 1/4 ถ้วย \n"
          "• ใบกะเพรา 1/2 ถ้วย \n"
          "• น้ำปลา 1 ช้อนโต๊ะ \n"
          "• น้ำตาลทราย 1 ช้อนชา \n"
          "• น้ำมันหอย 2 ช้อนโต๊ะ \n"
          "• พริกขี้หนู 8 เม็ด (หรือตามชอบ) \n"
          "• กระเทียม 6 กลีบ \n"
          "• น้ำซุปหรือน้ำเปล่า \n", 
        howto: 
          "• มาเริ่มด้วยการตำพริกกับกระเทียมกันก่อน พริกใส่มากหรือน้อยตามชอบ \n"
          "• หมูกรอบหั่นเป็นชิ้นตามชอบ \n"
          "• หั่นถั่วฝักยาวขาวอวบของเรา หั่นยาวหรือสั้นตามแต่ชอบ \n" 
          "• เสร็จแล้วก็ตั้งกระทะใส่น้ำมันพืช ผัดพริกกับกระเทียมที่เราตำไว้  \n"
          "• ผัดแล้วก็ใส่หมูกรอบตามลงไปผัดให้สุกร้อนดี \n"
          "• เติมน้ำซุปหรือน้ำเปล่านิดหน่อยเพราะจะได้ไม่ไหม้กระทะ \n"
          "• ใส่ถั่วฝักยาวลงไปผัด \n"
          "• ผัดให้ถั่วพอสุก \n"
          "• ปรุงรสด้วยน้ำตาลทราย น้ำปลา น้ำมันหอย \n"
          "• ผัดให้สุกเข้ากันแล้วชิมรสตามชอบ \n"
          "• สุดท้ายใส่กะเพราลงไป \n"
          "• ปิดไฟ ผัดให้เข้ากัน \n" ,
        linkclip: "https://youtu.be/V46iqHfop3o" ),


    Food(name: "🌻ผัดพริกแกงหมู", imagePath: "lib/images/picgang.jpg", 
        recipes: 
          "• หมูหั่นชิ้นหรือหมูสับ 300 กรัม \n" 
          "• น้ำพริกแกงเผ็ด 1-2 ช้อนโต๊ะ (ความเผ็ดตามชอบ) \n"
          "• ถั่วฝักยาวหั่นท่อน \n"
          "• ใบโหระพา (ใส่หรือไม่ใส่ก็ได้) \n"
          "• ใบมะกรูดซอย 10 ใบ \n"
          "• น้ำตาลทราย (ปรุงรส) \n"
          "• น้ำปลา (ปรุงรส) \n"
          "• น้ำมันพืช (สำหรับผัด) \n", 
        howto: 
          "• ตั้งกระทะใส่น้ำมันพืชลงไป พอร้อนใส่น้ำพริกแกงลงไปผัดพอหอม  \n"
          "• ใส่หมูลงไปผัดจนสุก ใส่ถั่วฝักยาวผัดตามชอบ \n"
          "• ปรุงรสด้วยน้ำตาลทรายกับน้ำปลา \n" 
          "• ใส่ใบโหระพาและใบมะกรูดซอย \n"
          "• ผัดพอเข้ากัน ปิดไฟ ยกลงจากเตา \n"
          "• ตักเสิร์ฟพร้อมข้าวสวยร้อน ๆ \n",
        linkclip: " ไม่มีวิดีโอสอนทำอาหาร" ),

    Food(name: "🌻ผัดคะน้าหมูกรอบ", imagePath: "lib/images/kana.jpg", 
        recipes: 
          "• คะน้า 1 ต้น \n" 
          "• หมูกรอบ (หั่นชิ้น) ตามชอบ \n"
          "• พริกขี้หนูทุบ ตามชอบ \n"
          "• กระเทียมสับ 1 ช้อนโต๊ะ \n"
          "• น้ำมันหอย 2 ช้อนชา \n"
          "• เต้าเจี้ยว 1 ช้อนโต๊ะ \n"
          "• น้ำตาลทราย 1 ช้อนชา \n"
          "• น้ำมันพืช (สำหรับผัด) \n", 
        howto: 
          "• ล้างผักคะน้าให้สะอาด พักให้สะเด็ดน้ำ หั่นเป็นชิ้นตามชอบ เตรียมไว้ \n"
          "• ใส่คะน้า หมูกรอบ พริกขี้หนู กระเทียมสับ น้ำมันหอย เต้าเจี้ยว และน้ำตาลทรายลงในอ่างผสม เตรียมไว้ \n"
          "• ใส่น้ำมันพืชลงในกระทะ เปิดไฟแรง พอน้ำมันร้อนจัด ใส่ผักลงไป ผัดพอสุก ประมาณ 30 วินาที \n" 
          "• ตักใส่จาน พร้อมเสิร์ฟ  \n",
        linkclip: "ไม่มีวิดีโอสอนทำอาหาร" ),

    Food(name: "🌻ผัดผงกะหรี่หมู", imagePath: "lib/images/padkare.jpg", 
        recipes: 
          "• เนื้อหมู 500 กรัม \n" 
          "• หอมใหญ่ 1 หัว \n"
          "• กระเทียมสับ (ตามชอบ) \n"
          "• พริกชี้ฟ้าแดง (ตามชอบ) \n"
          "• ต้นหอม (หั่นท่อน) 1 ถ้วย \n"
          "• ขึ้นฉ่าย (หั่นท่อนสั้น) 1 ถ้วย \n"
          "• ผงกะหรี่ 3 ช้อนโต๊ะ \n"
          "• ไข่ไก่  2 ฟอง \n"
          "• นมข้นจืด 225 มิลลิลิตร \n"
          "• น้ำพริกเผา 2-3 ช้อนโต๊ะ \n"
          "• น้ำตาลทราย 2 ช้อนโต๊ะ \n"
          "• พริกไทยป่น 1 ช้อนชา \n"
          "• ซอสปรุงรส 2 ช้อนโต๊ะ \n"
          "• น้ำมันหอย 2 ช้อนโต๊ะ \n", 
        howto: 
          "• ตีผสมน้ำพริกเผา \nน้ำมันหอย\n ซอสปรุงรส\n น้ำตาลทราย\n พริกไทยป่น\n ผงกะหรี่\n นมข้นจืด\n และไข่ไก่\n คนให้เข้ากัน\n เตรียมไว้ \n"
          "• ตั้งกระทะใส่น้ำมันพืช \n"
          "• ใส่กระเทียมลงไปผัดจนหอม \n" 
          "• ใส่เนื้อหมูลงไปผัดพอสุก  \n"
          "• ตามด้วยใส่หอมหัวใหญ่ พริกชี้ฟ้าแดง ลงไปผัดให้เข้ากัน \n"
          "• ใส่เครื่องปรุงที่เตรียมไว้ลงไป ผัดให้เข้ากันอีกรอบ \n"
          "• ตามด้วยใส่ต้นหอม ขึ้นฉ่าย คลุกเคล้าให้เข้ากัน \n"
          "• เป็นอันเสร็จ ตักใส่จาน พร้อมเสิร์ฟ \n",
        linkclip: "ไม่มีวิดีโอสอนทำอาหาร" ),

    Food(name: "🌻หมูทอดกระเทียม", imagePath: "lib/images/garlic-pork.jpg", 
        recipes: 
          "• เนื้อหมู (ชอบส่วนไหนก็ใช้ส่วนนั้นเลย) \n" 
          "• กระเทียมเจียว \n"
          "• น้ำตาลทราย \n"
          "• น้ำปลา \n"
          "• ผงปรุงรสหมู \n"
          "• ซอสปรุงรส \n"
          "• น้ำมันหอย (หรือซอสอเนกประสงค์ขวดเดียวจบ) \n"
          "• พริกไทย \n"
          "• น้ำมันพืช (สำหรับผัด) \n", 
        howto: 
          "• ใส่น้ำมันพืชลงในกระทะ ใช้ไฟปานกลาง \n"
          "• พอน้ำมันร้อนใส่เนื้อหมูลงไปผัดจนหมูใกล้สุก \n"
          "• ปรุงรสด้วยเครื่องปรุงรสทั้งหมด ชิมรสชาติตามชอบ (ถ้าได้แล้วก็จบเลย ถ้าอยากได้เปียก ๆ ก็ใส่น้ำเพิ่มลงไปได้)  \n" 
          "• ใส่กระเทียมเจียวสำเร็จรูปลงไปคลุกเคล้าให้เข้ากัน  \n"
          "• ตักใส่จาน โรยกระเทียมเจียวอีกเล็กน้อยให้สวยงาม พร้อมเสิร์ฟ \n",
        linkclip: "ไม่มีวิดีโอสอนทำอาหาร" ),

        Food(name: "🌻ผัดเปรี้ยวหวานหมู", imagePath: "lib/images/pewwan.jpg", 
        recipes: 
          "• กระเทียมไทยสับ 1 ช้อนโต๊ะ \n" 
          "• เนื้อหมู 200 กรัม (หั่นเป็นชิ้นบาง ๆ) \n"
          "• สับปะรด (หั่นชิ้นพอดีคำ) 1 ถ้วย \n"
          "• แตงกวา (หั่นชิ้นพอดีคำ) 1 ถ้วย \n"
          "• หอมใหญ่ (หั่นเสี้ยว) 1 หัว \n"
          "• พริกฝรั่งเหลือง 1/2 ลูก \n"
          "• มะเขือเทศ 1 ลูกใหญ่ (หั่น 4 ส่วน) \n"
          "• ต้นหอม (หั่นท่อน) 1 ต้น \n"
          "• ซอสมะเขือเทศ 1/2 ถ้วย \n"
          "• น้ำตาลทราย 1-2 ช้อนโต๊ะ \n"
          "• เกลือป่น หรือน้ำปลาเล็กน้อย \n"
          "• น้ำเปล่า 3 ช้อนโต๊ะ \n"
          "• น้ำมันพืช (สำหรับผัด) \n", 
        howto: 
          "• เจียวกระเทียมสับในน้ำมันพืชจนหอม \n"
          "• จากนั้นใส่เนื้อหมูลงไปผัดจนสุก \n"
          "• ใส่สับปะรด แตงกวา หอมใหญ่ พริกฝรั่ง ต้นหอม และมะเขือเทศลงไปผัดจนสุก \n" 
          "• ปรุงรสด้วยซอสมะเขือเทศ น้ำตาลทราย และเกลือป่น  \n"
          "• ใส่น้ำเปล่าลงไปเล็กน้อย ผัดให้เข้ากัน \n"
          "• ชิมรสตามชอบ พร้อมเสิร์ฟ \n",
        linkclip: "ไม่มีวิดีโอวิธีการทำ" ),

        Food(name: "🌻ผัดกะเพราเต้าหู้ไข่", imagePath: "lib/images/tofukapao.jpg", 
        recipes: 
          "• เต้าหู้ไข่ 1 หลอด (หั่นเป็นแว่น ๆ) \n" 
          "• แป้งทอดกรอบ  3 ช้อนโต๊ะ \n"
          "• พริกขี้หนู 7-10 เม็ด (หรือปริมาณตามชอบ) \n"
          "• กระเทียมไทย 2 ช้อนโต๊ะ \n"
          "• หมูสับ 150 กรัม \n"
          "• ซอสปรุงรส 1/2 ช้อนโต๊ะ \n"
          "• ซีอิ๊วขาว 1/2 ช้อนโต๊ะ \n"
          "• ซอสหอยนางรม 1 ช้อนโต๊ะ \n"
          "• น้ำตาลทราย 1/2 ช้อนชา \n"
          "• น้ำซุป 3 ช้อนโต๊ะ (หรือน้ำเปล่า) \n"
          "• น้ำมันพืช (สำหรับผัดและทอดเต้าหู้ไข่) \n"
          "• ใบกะเพรา (เด็ดเป็นใบ) 1 ถ้วย \n"
          "• ข้าวสวย และไข่ดาว (สำหรับเสิร์ฟ) \n", 
        howto: 
          "• สับพริกกับกระเทียมเข้าด้วยกันแบบหยาบ ๆ \n"
          "• ใช้กระดาษอเนกประสงค์ซับเต้าหู้ไข่ให้ผิวด้านนอกแห้ง \n"
          "• จากนั้นนำไปคลุกกับแป้งทอดกรอบให้ทั่วทั้งชิ้น แล้วนำลงทอดในกระทะที่น้ำมันร้อนจัด \n" 
          "• ใช้ไฟปานกลางทอดจนสุกเหลืองทั่วทั้งชิ้น ตักขึ้นพักไว้ให้สะเด็ดน้ำมัน  \n"
          "• ใส่น้ำมันสำหรับผัดลงไปในกระทะ นำขึ้นตั้งไฟกลาง \n"
          "• รอจนน้ำมันร้อนแล้วใส่พริกกับกระเทียมที่โขลกไว้ลงไปผัดพอหอม จากนั้นใส่หมูสับลงไปผัดจนสุก \n"
          "• ปรุงรสด้วยซอสปรุงรส ซีอิ๊วขาว น้ำตาลทราย และซอสหอยนางรม  \n"
          "• เติมน้ำเปล่าลงไปเล็กน้อยเพื่อให้มีน้ำขลุกขลิก ผัดให้เข้ากัน ชิมรสตามต้องการ  \n"
          "• ใส่เต้าหู้ไข่ลงไปเคล้าเบา ๆ ตามด้วยใบกะเพรา \n"
          "• ผัดให้เข้ากันไม่ต้องนาน ตักใส่จาน พร้อมเสิร์ฟ \n",
        linkclip: "https://youtu.be/V46iqHfop3o" ),

        
  ];

  final List<Food> _favorite = [];

  List<Food> get foodMenu => _foodMenu;
  List<Food> get favorite => _favorite;

  void addToFav(Food foodItem) {
    
      _favorite.add(foodItem);
    
    notifyListeners();
  }

  void removeFromFav(Food food) {
    _favorite.remove(food);
    notifyListeners();
  }
  
}

